# Bank Marketing

The data is related with direct marketing campaigns of a Portuguese banking institution. 
   The marketing campaigns were based on phone calls. Often, more than one contact to the same client was required, 
   in order to access if the product (bank term deposit) would be (or not) subscribed.

Input variables:
   # bank client data:
   1 - age (numeric)
   2 - job : type of job (categorical: "admin.","unknown","unemployed","management","housemaid","entrepreneur","student",
                                       "blue-collar","self-employed","retired","technician","services") 
   3 - marital : marital status (categorical: "married","divorced","single"; note: "divorced" means divorced or widowed)
   4 - education (categorical: "unknown","secondary","primary","tertiary")
   5 - default: has credit in default? (binary: "yes","no")
   6 - balance: average yearly balance, in euros (numeric) 
   7 - housing: has housing loan? (binary: "yes","no")
   8 - loan: has personal loan? (binary: "yes","no")
   # related with the last contact of the current campaign:
   9 - contact: contact communication type (categorical: "unknown","telephone","cellular") 
  10 - day: last contact day of the month (numeric)
  11 - month: last contact month of year (categorical: "jan", "feb", "mar", ..., "nov", "dec")
  12 - duration: last contact duration, in seconds (numeric)
   # other attributes:
  13 - campaign: number of contacts performed during this campaign and for this client (numeric, includes last contact)
  14 - pdays: number of days that passed by after the client was last contacted from a previous campaign (numeric, -1 means client was not previously contacted)
  15 - previous: number of contacts performed before this campaign and for this client (numeric)
  16 - poutcome: outcome of the previous marketing campaign (categorical: "unknown","other","failure","success")

  Output variable (desired target):
  17 - y - has the client subscribed a term deposit? (binary: "yes","no")

# Import Libraries

In [1]:
import pandas as pd
import numpy as np

# Read the data

In [2]:
df=pd.read_csv('bankclean.csv')

In [3]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [4]:
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
45206,51,technician,married,tertiary,no,825,no,no,cellular,17,nov,977,3,-1,0,unknown,yes
45207,71,retired,divorced,primary,no,1729,no,no,cellular,17,nov,456,2,-1,0,unknown,yes
45208,72,retired,married,secondary,no,5715,no,no,cellular,17,nov,1127,5,184,3,success,yes
45209,57,blue-collar,married,secondary,no,668,no,no,telephone,17,nov,508,4,-1,0,unknown,no
45210,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other,no

# check Information about data

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [6]:
df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

In [7]:
for  col in df.columns:
    print('{}: {} unique values'.format(col,df[col].nunique()))

age: 77 unique values
job: 12 unique values
marital: 3 unique values
education: 4 unique values
default: 2 unique values
balance: 7168 unique values
housing: 2 unique values
loan: 2 unique values
contact: 3 unique values
day: 31 unique values
month: 12 unique values
duration: 1573 unique values
campaign: 48 unique values
pdays: 559 unique values
previous: 41 unique values
poutcome: 4 unique values
y: 2 unique values

In [8]:
df.groupby('job').mean()

,age,balance,day,duration,campaign,pdays,previous
job,,,,,,,
admin.,39.289886,1135.838909,15.564301,246.896732,2.575324,47.859021,0.671630
blue-collar,40.044081,1078.826654,15.442561,262.901562,2.816995,44.033498,0.505138
entrepreneur,42.190989,1521.470074,15.702085,256.309348,2.799597,32.486214,0.478144
housemaid,46.415323,1392.395161,16.002419,245.825000,2.820968,21.505645,0.371774
management,40.449567,1763.616832,16.114189,253.995771,2.864348,38.665468,0.668006
retired,61.626767,1984.215106,15.439488,287.361307,2.346731,37.443905,0.638693
self-employed,40.484484,1647.970868,16.027866,268.157061,2.853072,34.747308,0.551615
services,38.740250,997.088108,15.635532,259.318729,2.718344,41.995185,0.501204
student,26.542644,1388.060768,14.897655,246.656716,2.299574,57.041578,0.953092
technician,39.314598,1252.632092,16.408582,252.904962,2.906805,37.195077,0.574569
unemployed,40.961627,1521.745971,15.498081,288.543361,2.432080,34.146585,0.466616
unknown,47.593750,1772.357639,14.642361,237.611111,3.309028,20.982639,0.319444

In [9]:
df.groupby('education').mean()

,age,balance,day,duration,campaign,pdays,previous
education,,,,,,,
primary,45.865567,1250.949934,15.421398,255.933002,2.834331,36.081740,0.489272
secondary,39.964270,1154.880786,15.759159,258.685760,2.700802,42.353504,0.567753
tertiary,39.593640,1758.416435,16.086535,258.518532,2.825577,39.024134,0.661980
unknown,44.510501,1526.754443,15.810985,257.313947,2.849219,36.856220,0.488422

# Convert categorical data to numeric using LabelEncoder

In [10]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df["job"] = le.fit_transform(df["job"])
df["marital"] = le.fit_transform(df["marital"])
df["education"] = le.fit_transform(df["education"])
df["default"] = le.fit_transform(df["default"])
df["housing"] = le.fit_transform(df["housing"])
df["loan"] = le.fit_transform(df["loan"])
df["contact"] = le.fit_transform(df["contact"])
df["month"] = le.fit_transform(df["month"])
df["poutcome"] = le.fit_transform(df["poutcome"])
df['y']= le.fit_transform(df['y'])

In [11]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,4,1,2,0,2143,1,0,2,5,8,261,1,-1,0,3,0
1,44,9,2,1,0,29,1,0,2,5,8,151,1,-1,0,3,0
2,33,2,1,1,0,2,1,1,2,5,8,76,1,-1,0,3,0
3,47,1,1,3,0,1506,1,0,2,5,8,92,1,-1,0,3,0
4,33,11,2,3,0,1,0,0,2,5,8,198,1,-1,0,3,0

In [12]:
X=df.iloc[:,:-1]
y=df.iloc[:,-1]

In [13]:
X.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,4,1,2,0,2143,1,0,2,5,8,261,1,-1,0,3
1,44,9,2,1,0,29,1,0,2,5,8,151,1,-1,0,3
2,33,2,1,1,0,2,1,1,2,5,8,76,1,-1,0,3
3,47,1,1,3,0,1506,1,0,2,5,8,92,1,-1,0,3
4,33,11,2,3,0,1,0,0,2,5,8,198,1,-1,0,3

In [14]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: y, dtype: int32

# Data normalization

In [15]:
from sklearn import preprocessing
X =preprocessing.StandardScaler().fit_transform(X)

# spliting-up the data

In [16]:
 from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=10)

# Implimenting Logistic Regression

In [17]:
from sklearn.linear_model import LogisticRegression
log_reg = LogisticRegression(random_state=10)
log_reg.fit(X_train,y_train)

LogisticRegression(random_state=10)

In [18]:
y_predict = log_reg.predict(X_test)

In [19]:
prediction_output=pd.DataFrame(data=[y_test.values,y_predict],index=['y_test','y_predict'])

In [20]:
prediction_output

,0,1,2,3,4,5,6,7,8,9,...,13554,13555,13556,13557,13558,13559,13560,13561,13562,13563
y_test,0,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,1,0
y_predict,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0

In [21]:
prediction_output.transpose()

       y_test  y_predict
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0
...       ...        ...
13559       0          0
13560       0          0
13561       0          0
13562       1          1
13563       0          0

[13564 rows x 2 columns]

In [22]:
#confusion metrix
from sklearn.metrics import confusion_matrix
cun=confusion_matrix(y_test,y_predict)
cun

array([[11761,   245],
       [ 1208,   350]], dtype=int64)

In [23]:
from sklearn.metrics import classification_report
print(classification_report(y_test,y_predict))

              precision    recall  f1-score   support

           0       0.91      0.98      0.94     12006
           1       0.59      0.22      0.33      1558

    accuracy                           0.89     13564
   macro avg       0.75      0.60      0.63     13564
weighted avg       0.87      0.89      0.87     13564

In [24]:
df['y'].value_counts()

0    39922
1     5289
Name: y, dtype: int64

# F1 score

In [60]:
from sklearn.metrics import f1_score

In [50]:
score_lr

0.8709865669556323

# Implimenting Decision Tree Classifier

In [25]:
from sklearn.tree import DecisionTreeClassifier
dtc_model = DecisionTreeClassifier(criterion="entropy", splitter="best", random_state=100)
dtc_model.fit(X_train, y_train)

DecisionTreeClassifier(criterion='entropy', random_state=100)

In [26]:
y_predict_dt = dtc_model.predict(X_test)

In [27]:
prediction_output_dt=pd.DataFrame(data=[y_test.values,y_predict_dt],index=['y_test','y_predict_dt'])

In [28]:
prediction_output.transpose()

       y_test  y_predict
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0
...       ...        ...
13559       0          0
13560       0          0
13561       0          0
13562       1          1
13563       0          0

[13564 rows x 2 columns]

In [29]:
#confusion matrix
cun=confusion_matrix(y_test,y_predict_dt)
cun

array([[11190,   816],
       [  774,   784]], dtype=int64)

In [30]:
print(classification_report(y_test,y_predict_dt))

              precision    recall  f1-score   support

           0       0.94      0.93      0.93     12006
           1       0.49      0.50      0.50      1558

    accuracy                           0.88     13564
   macro avg       0.71      0.72      0.72     13564
weighted avg       0.88      0.88      0.88     13564

# F1 score

In [51]:
score_dt = f1_score(y_test, y_predict_dt,average = 'weighted')

In [52]:
score_dt

0.8834547446418977

# Implimenting Random Forest Classifier

In [31]:
from sklearn.ensemble import RandomForestClassifier
rfc_model = RandomForestClassifier(n_estimators=100, criterion="entropy", random_state=100)
rfc_model.fit(X_train, y_train)

RandomForestClassifier(criterion='entropy', random_state=100)

In [32]:
y_predict_rf = rfc_model.predict(X_test)

In [33]:
prediction_output_dt=pd.DataFrame(data=[y_test.values,y_predict_rf],index=['y_test','y_predict_rf'])

In [34]:
prediction_output.transpose()

       y_test  y_predict
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0
...       ...        ...
13559       0          0
13560       0          0
13561       0          0
13562       1          1
13563       0          0

[13564 rows x 2 columns]

In [35]:
#confusion metrix
cun=confusion_matrix(y_test,y_predict_rf)
cun

array([[11672,   334],
       [  914,   644]], dtype=int64)

In [36]:
print(classification_report(y_test,y_predict_rf))

              precision    recall  f1-score   support

           0       0.93      0.97      0.95     12006
           1       0.66      0.41      0.51      1558

    accuracy                           0.91     13564
   macro avg       0.79      0.69      0.73     13564
weighted avg       0.90      0.91      0.90     13564

# F1 score

In [53]:
score_rf = f1_score(y_test, y_predict_rf,average = 'weighted')

In [54]:
score_rf

0.8985552969167011

# Comparing F1 Score

In [57]:
columns = ["Logistin Regression","Decision Tree Classification", "Random Forest Classification",]
Data = [score_lr * 100, score_dt * 100, score_rf * 100]
dict1 = {
    "Classification Algorithms Implemented" : columns,
    "F1 Scores" : Data
}
Classification_Scores = pd.DataFrame(dict1, index = [1,2,3])

In [59]:
Classification_Scores

  Classification Algorithms Implemented  F1 Scores
1                   Logistin Regression  87.098657
2          Decision Tree Classification  88.345474
3          Random Forest Classification  89.855530